app/controllers/api/feeds_controller.rb

  def show
    render :json => Feed.find(params[:id]), :include => :latest_entries
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ?  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    feed = Feed.find_or_create_by_url(feed_params[:url])
---
INSERT INTO "feeds" ("created_at", "title", "updated_at", "url") VALUES (?, ?, ?, ?)
SELECT "feeds".* FROM "feeds" WHERE "feeds"."url" = 'http://lorem-rss.herokuapp.com/feed?unit=day' LIMIT 1

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy
    render :json => Feed.all
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 6]]
SELECT "feeds".* FROM "feeds"